/**
 * Created by liuchun on 2016/12/07.
 */
var $ = require('jquery');
require('css/style.css');
// 跑马灯效果方法
(function($){
  $.fn.msAccordion = function(options) {
    options = $.extend({
      currentDiv:'1',
      previousDiv:'',
      vertical: false,
      defaultid:0,
      currentcounter:0,
      intervalid:0,
      autodelay:0,
      event:"mouseenter",
      alldivs_array:new Array()
    }, options);
    $(this).addClass("accordionWrapper");
    $(this).css({overflow:"hidden"});
    //alert(this);
    var elementid = $(this).attr("id");
    var allDivs = this.children();
    if(options.autodelay>0)  {
      $("#"+ elementid +" > div").bind("mouseenter", function(){
        pause();
      });
      $("#"+ elementid +" > div").bind("mouseleave", function(){
        startPlay();
      });
    }
    //set ids
    allDivs.each(function(current) {
      var iCurrent = current;
      var sTitleID = elementid+"_msTitle_"+(iCurrent);
      var sContentID = sTitleID+"_msContent_"+(iCurrent);
      var currentDiv = allDivs[iCurrent];
      var totalChild = currentDiv.childNodes.length;
      var titleDiv = $(currentDiv).find("div.courseBook-title");
      titleDiv.attr("id", sTitleID);
      var contentDiv = $(currentDiv).find("div.courseBook-content");
      contentDiv.attr("id", sContentID);
      options.alldivs_array.push(sTitleID);
      //$("#"+sTitleID).click(function(){openMe(sTitleID);});
      $("#"+sTitleID).bind(options.event, function(){pause();openMe(sTitleID);});
    });

    //make vertical
    if(options.vertical) {makeVertical();};
    //open default
    openMe(elementid+"_msTitle_"+options.defaultid);
    if(options.autodelay>0) {startPlay();};
    //alert(allDivs.length);
    function openMe(id) {
      var sTitleID = id;
      var iCurrent = sTitleID.split("_")[sTitleID.split("_").length-1];
      options.currentcounter = iCurrent;
      var sContentID = id+"_msContent_"+iCurrent;
      if($("#"+sContentID).css("display")=="none") {
        if(options.previousDiv!="") {
          closeMe(options.previousDiv);
        };
        if(options.vertical) {
          $("#"+sContentID).slideDown("slow");
        } else {
          $("#"+sContentID).show("slow");
        }
        options.currentDiv = sContentID;
        options.previousDiv = options.currentDiv;
      };
    };
    function closeMe(div) {
      if(options.vertical) {
        $("#"+div).slideUp("slow");
      } else {
        $("#"+div).hide("slow");
      };
    };
    function makeVertical() {
      $("#"+elementid +" > div").css({display:"block", float:"none", clear:"both"});
      $("#"+elementid +" > div > div.courseBook-title").css({display:"block", float:"none", clear:"both"});
      $("#"+elementid +" > div > div.courseBook-content").css({clear:"both"});
    };
    function startPlay() {
      options.intervalid = window.setInterval(play, options.autodelay*1000);
    };
    function play() {
      var sTitleId = options.alldivs_array[options.currentcounter];
      openMe(sTitleId);
      options.currentcounter++;
      if(options.currentcounter==options.alldivs_array.length) options.currentcounter = 0;
    };
    function pause() {
      window.clearInterval(options.intervalid);
    };
  }
})(jQuery);
(function () {
  // 跑马灯效果设置
  $("#J_courseInfoBook").msAccordion({defaultid:0});
  // 年级科目筛选设置
  var gradeItem = $('.j_courseGrade span');
  var subjectItem = $('.j_courseSubject span');
  var grade = 'c1';
  var subject = 'math';
  var levelsData = {
      "c1": {
        "math": [
          {
            "goal": "1.学校上课能轻松跟上进度，计算不出错<br>2.打好基础，培养解题思路，并能完整写出过程，考试能拿到分",
            "method": "巩固基础知识:<br>1.使用同步提高基础课巩固复习,视频课中明示罗列所有基础知识,并作详细讲解,学生可做笔记。<br>2.教练连线询问学生,提问概念,定理等,确保学生理解记忆。<br><br>培养阶梯思维:<br>针对刚听过的知识,马上练题,学生先自主思考,讲义上自主做题,不会的听视频讲解,听完后教练点播总结方法。<br><br>学习解题步骤书写:<br>教练引导学生书写解题过程,查阅每一道题,指出学生做题过程中的每一个问题。"
          },
          {
            "goal": "1.加深对基础知识的理解，确保学生做一道会一道，力争学过的知识，做过的题目100%掌握<br>2.难题突破，会熟练使用计算技巧提高计算速度和正确率",
            "method": "1.加深对基础知识的理解：使用同步提高课中重难点易错点辨析，确保各个知识模块的重难点易错点掌握透彻<br>2.通过错题追踪策略，本次课的错题下次课重做，确保教练伴学课上所有做过的题100%掌握<br>3.做一部分满分冲刺中题目，挑战难题<br>4.教练严格把关，杜绝做题敷衍，克服粗心的问题"
          },
          {
            "goal": "1.重点攻克难题，确保以后知识点难度增大后成绩能保持<br>2.考试不丢分，冲刺满分",
            "method": "1.使用满分冲刺课做大量难题的练习，保证数学思维能力保持在顶尖水平，考试遇到难题有思路<br>2.通过教练伴学限时做题，每道题自判对错，教练把关，从平时做题开始，练习自己能够快速、准确做出所有题的能力，考试不丢分，冲刺满分"
          }
        ],
        "english": [
          {
            "goal": "1.打好基础，跟上学校教学进度，掌握重点词汇和语言知识，有针对性提升读写能力<br>2.学会知识的应用，简单题不丢分，中档题少丢分",
            "method": "1.用同步基础课巩固词汇和语言知识<br>2.先自主思考，讲义上自主做题，不会的听视频讲解，听完后教练点拨总结方法<br>3.发现学生有问题，教练及时答疑解惑；查阅学生提交的题目，发现问题连线解决，确保学生听一题，会一类<br>4.教练定制课上课下复习计划，帮助学生养成良好的背单词、复习笔记错题的习惯，学生定量完成阅读、完型等练习"
          },
          {
            "goal": "1.熟练掌握所有词汇和语言知识，加深对基础知识的理解，全面提升读写能力，培养语感<br>2.学会知识的应用，中档题不丢分，做完型、阅读、写作有思路，少丢分",
            "method": "1.用同步提高课与学校同步复习，巩固所学内容；确保各专题模块的重难点易错点掌握透彻<br>2.教练严格把关，杜绝做题敷衍，克服粗心问题；重点题拓展思路、举一反三<br>3.学生先自主思考，讲义上自主做题，有问题听视频课，总结方法技巧，确保做过的题100%掌握"
          },
          {
            "goal": "1.大力拓展较难词汇的认知和使用，加深对较难知识的理解，全面提升听说读写能力<br>2.重点攻克完型、阅读、写作等难题，考试争取不丢分，冲刺满分",
            "method": "1.选用同步提高课与学校同步复习，巩固所学内容；确保各专题模块的重难点易错点掌握透彻<br>2.教练发现学生问题，重难点题拓展思路、举一反三<br>3.通过教练伴学限时做题，练习快速、准确做出所有题的能力，争取考试不丢分，冲刺满分"
          }
        ]
      },
      "c2": {
        "math": [
          {
            "goal": "1.发现并解决学习中存在的问题，重新规划学习方向和目标<br>2.打好基础的同时查缺补漏<br>3.积累初二所涉及的常见几何模型，经典代数运算方法，做题有思路",
            "method": "培养解题思维:<br>1.针对刚听过的知识，马上练题，学生先自主思考，讲义上自主做题，不会的听视频讲解，听完后教练点播总结方法<br>2.视频课中名师总结初二年级经典几何模型，经典代数运算方法，让学生做题时思路上有据可循，适应初二数学难度的增加<br><br>规范证明题过程:<br>初二大量涉及几何证明题，教练检查学生的证明步骤，确保几何证明题过程规范"
          },
          {
            "goal": "1.掌握高效学习方法，避开题海战术<br>2.加深对重难点知识的理解，知识不留死角，学过的题确保100%掌握",
            "method": "1.做题在于精而不在于多，通过错题追踪策略以及教练的引导，系统地、透彻地掌握同步提高课中所有难点知识以及经典题型<br>2.通过视频名师讲解和教练点拨，学生自己总结、积累初二年级经典几何模型及代数运算方法，后续做题遇到能够熟练应用<br>3.挑战部分满分冲刺中题目，挑战难题"
          },
          {
            "goal": "1.重点攻克难题，遇到难题都能有思路<br>.2.考试不丢分，冲刺满分",
            "method": "1.难题会做：使用满分冲刺课做大量难题的练习，保证数学思维能力保持在顶尖水平，考试遇到难题有思路<br>2.做题不出错：通过教练伴学限时做题，每道题自判对错，教练把关，从平时做题开始，练习自己能够快速、准确做出所有题的能力，考试不丢分，冲刺满分"
          }
        ],
        "english": [
          {
            "goal": "1.掌握大纲所要求的时态、词法、句法知识<br>2.打好基础的同时查缺补漏，培养语感，提升读写能力<br>3.简单题不丢分，中档题多得分",
            "method": "1.用同步基础课与学校同步复习，巩固所学内容<br>2.教练指出学生薄弱知识点，引领学生利用名师视频课查缺补漏<br>3.课上把重难点知识记笔记并随时复习，下次课复习错题，确保百分比掌握"
          },
          {
            "goal": "1.熟练掌握所有词汇和语言知识，加深对基础知识的理解，全面提升读写能力<br>2.学会知识的应用，中档题不丢分，做完型、阅读、写作有思路，少丢分",
            "method": "1.用同步提高课与学校同步复习，巩固所学内容；确保各专题模块的重难点易错点掌握透彻<br>2.教练严格把关，杜绝做题敷衍，克服粗心问题；重点题拓展思路、举一反三"
          },
          {
            "goal": "1.大力拓展较难词汇的认知和使用，加深对较难知识的理解，全面提升听说读写能力，培养语感<br>2.重点攻克完型、阅读、写作等难题，考试争取不丢分，冲刺满分",
            "method": "1.使用部分同步提高课、专项突破课，做大量难题练习，使英语思维保持在顶尖水平，考试遇到难题有思路、能突破<br>2.练习快速、准确做出所有题的能力，争取考试不丢分，冲刺满分"
          }
        ],
        "physics": [
          {
            "goal": "1.跟上学校进度，掌握基本物理概念和公式<br>2.简单题能作对，中等题作对一大部分<br>3.通过基本物理概念的记忆逐渐培养学习兴趣和学习习惯",
            "method": "1.教练指导本节知识重难点，根据学生本身情况给出具体提升方案,结合学生情况给出相应课后课指导<br>2.教练解答学生疑问，发现学生解题过程中思路、方法问题，进行指导，启发学生思考"
          },
          {
            "goal": "1.学校讲的都能懂，完全跟上学校进度<br>2.中等题不丢分，难题能拿部分分，夯实力学基础<br>3.对物理规律和概念的认知由机械记忆转为意义记忆，最终形成逻辑记忆",
            "method": "1.学生根据教练方案，学习相应内容<br>2.通过基础课程和部分提高课程逐步夯实基础，养成独立思考和做题的习惯<br>3.通过教练伴学课的学习在教练帮助下总结方法和解题思路技巧，逐步培养科学的思维习惯"
          },
          {
            "goal": "1.掌握学校内容，能根据所学知识延展思维获得更多<br>2.能解决绝大多数难题，举一反三，非难题都做对，无知识漏洞<br>3.对于基本的物理模型和思考方法有一定的了解和掌握",
            "method": "1.教练规划学生学习方向，找到优等生知识漏洞，给予指导<br>2.教练解答学生疑问，通过学生提交做题情况，解决学生做题思路问题，使学生知识、做题无死角<br>3.学生根据教练方案，学习相应内容，并不断总结知识点，提升自己对于力学综合题的把握"
          }
        ]

      },
      "c3": {
        "math": [
          {
            "goal": "1.正确看待考试，特别是中考，对自己有信心，确定自己努力的方向<br>2.学校正在学的知识，最基本的要掌握，其他的尽可能掌握<br>3.抽时间补初一初二薄弱知识",
            "method": "调整学习状态:<br>1.教练鼓励、陪伴学生，让学生找回学习的积极性<br>2.教练针对学生情况，针对中考该抓哪些分，确定学习侧重点和要求<br><br>巩固基础:<br>1.使用同步基础课巩固复习，视频课中名师罗列所有基础知识，并作详细讲解，学生可做笔记<br>2.针对刚听过的知识，马上练题，学生先自主思考，讲义上自主做题，不会的听视频讲解，听完后教练点播总结方法<br>3.教练连线询问学生，提问基本概念、基本方法，确保学生理解透彻"
          },
          {
            "goal": "1.学校正在学的知识及题型掌握透彻<br>2.着手一二轮复习，针对中考题型，做到中档题不丢分，对于常见的几类中考压轴题题型，要完全掌握",
            "method": "同步复习:<br>1.使用同步提高课，通过错题追踪策略以及教练把关，100%掌握同步提高里的题目。在名师及教练的引导下，总结几何题，二次函数题，代几综合等题型的做题方法<br>2.针对中考压轴题考点，听完对应知识模块的满分冲刺课<br><br>一二轮复习:<br>使用中考一二轮，做中考真题练习，明确考试题型，通过初三一年的练习，做到中档题不丢分，常考压轴题型完全掌握"
          },
          {
            "goal": "1.跟着学校进度做难题练习<br>2.针对中考，做到考试不丢分，冲刺满分",
            "method": "1.使用满分冲刺课做大量难题的练习，确保初三新学的几大难点的难题完全掌握<br>2.使用中考一二轮，做中考真题练习，明确考试题型，通过限时做题和自判，从平时练习开始，做到做题不出错，中考冲刺满分"
          }
        ],
        "english": [
          {
            "goal": "1.打好基础的同时查缺补漏，培养语感，提升听说读写能力<br>2.学会知识的应用，简单题不丢分，中档题少丢分",
            "method": "1.前期用同步基础课与学校同步复习，巩固所学内容；后期用中考一二轮，全面备战中考<br>2.学生先自主思考，讲义上自主做题，不会的听视频讲解，听完后教练点拨总结方法<br>3.学生自我总结错题的错点、错因、今后如何做，提升学生的自我学习能力"
          },
          {
            "goal": "1.熟练掌握所有词汇和语言知识，加深对基础知识的理解，全面提升读写能力，培养语感<br>2.学会知识的应用，中档题不丢分，做完型、阅读、写作有思路，少丢分",
            "method": "1.前期用同步提高课与学校同步复习，巩固所学内容，后期用中考一二轮；确保各专题模块的重难点易错点掌握透彻<br>2.教练严格把关，杜绝做题敷衍，克服粗心问题；重点题拓展思路、举一反三<br>3.练习限时阅读和写作，全面提升写作和阅读水平，考试时少丢分"
          },
          {
            "goal": "1.大力拓展较难词汇的认知和使用，加深对较难知识的理解<br>2.重点攻克完型、阅读、写作等难题，考试争取不丢分，冲刺满分",
            "method": "1.前期用同步提高课、专项课与学校同步复习，确保各专题模块的重难点易错点掌握透彻，后期用中考一二三轮<br>2.突破综合专项题，重点完型、阅读、写作等，练习快速解题、冲刺满分<br>3.增加听力与口语练习，提高听说能力"
          }
        ],
        "physics": [
          {
            "goal": "1.跟上学校进度，基础知识点掌握全面<br>2.能够清楚的知道物理规律和现象，对于识记类的简单题能作对，中等题作对一大部分",
            "method": "1.认真听取名师讲解，积极互动，答题，通过对基础知识的学习树立信心<br>2.教练指导知识重难点，根据学生本身情况给出具体提升方案，解答学生疑问，发现学生解题过程中思路、方法问题，进行指导，启发学生思考"
          },
          {
            "goal": "1.学校讲的都能懂，完全跟上学校进度<br>2.中等题不丢分，难题能拿部分分,夯实力学和电学基础<br>3.能够利用已经掌握的规律和概念分析、解决实际问题，能灵活应用",
            "method": "1.定位学生知识漏洞，针对漏洞给出伴学课和课后课解决方案<br>2.通过教练伴学课夯实基础，通过金题精讲熟练掌握物理规律和概念及公式的应用"
          },
          {
            "goal": "1.能够轻松解决力热光电等各种综合题，能根据所学知识延展思维获得更多<br>2.能解决绝大多数难题，举一反三，非难题都做对，无知识漏洞",
            "method": "1.规划学生学习方向，找到优等生知识漏洞，给予指导<br>2.解答学生疑问，通过学生提交做题情况，解决学生做题思路问题，使学生知识、做题无死角<br>3.通过大量综合题的训练对物理规律和概念的理解能够熟练灵活处理"
          }
        ],
        "chemistry": [
          {
            "goal": "1.学校上课大部分都能听懂，跟上学校的进度<br>2.在化学与生活等基础题型上争取不丢分，在中档题上尽量少丢分",
            "method": "1.用同步基础课梳理酸碱盐、溶液、金属等重点章节的知识，在教练的帮助下更好的理解和掌握这些知识<br>2.根据教练给出的阶段提升计划，学习相应的内容<br>3.课上教练查阅学生的每一道题，发现学生问题，并帮助学生改进"
          },
          {
            "goal": "1.学校讲的都能听懂，完全跟上学校进度<br>2.中档题尽量拿到满分，难题拿少部分分数<br>3.中考化学尽量少丢分，拉升中考总分",
            "method": "1.用同步提高课学习酸碱盐、溶液、金属的综合应用的解题方法，在教练的帮助下提高知识的综合运用能力<br>2.将自己的做题步骤提交给教练，教练会发现你解题当中的问题<br>3.根据教练给出的学习计划，学习相应的内容"
          },
          {
            "goal": "1.冲刺满分，进一步提高解答难题的能力<br>2.难题，看到就有思路，能拿到满分<br>3.中考化学争取能考到满分",
            "method": "1.用同步基础课和一二轮复习课学习实验题、实验探究题、推断题，的解题方法和思路，在教练的帮助下攻克所有疑点<br>2.有任何疑问都可以提交给教练，教练会帮你及时解决，并总结归纳知识点<br>3.根据教练给出的学习计划，学习相应的内容，在教练的帮助下冲刺满分"
          }
        ]

      },

      "g1": {
        "math": [
          {
            "goal": "1.学校上课大部分都能听懂，基本跟上学校教学进度。提高课堂的积极性及效率，专心听讲<br>2.同步巩固基础知识，查缺补漏，掌握常见简单题中等题的解题思路，提高做题速度，规范解题步骤，基础题不丢分，中等题少丢分<br>3.培养自信，增强学习动力及主动性",
            "method": "1.先听同步基础课（注意和学校进度保持同步）<br>2.再听同步提高课前面几道简单题（注意和同步基础课知识点对应）<br>3.时间充分的话，回头补听没有听过的章节<br>4.期中期末考前听考前串讲，考后针对失分点用同步基础课程补习<br>5.每章学完以后用同步基础综合专题、习题课进行巩固"
          },
          {
            "goal": "1.学校讲的都能听懂，完全跟上学校进度<br>2.针对性查缺补漏，哪儿弱赶紧补哪儿，不留任何知识漏洞<br>3.提高解中等题能力及做题速度，规范书写步骤，锻炼思维能力，培养总结反思能力",
            "method": "1.先听同步提高课（注意和学校进度保持同步）<br>2.再听满分冲刺课程前几道题目进行拔高（注意和同步课知识对应）<br>3.时间充分的话，回头补听没有听过的章节<br>4.期中期末考前听同步提高、满分冲刺考前串讲，考后针对丢分点用同步提高课程补习<br>5.每章学完以后用同步提高、同步基础综合专题、习题课进行巩固拔高"
          },
          {
            "goal": "1.冲刺满分，进一步提高解答难题的能力<br>2.锻炼探索型、研究型、创新型思维能力，勤总结勤思考<br>3.学习进度适当加快，走在学校前面",
            "method": "1.先听满分冲刺课（注意和学校进度保持同步）<br>2.较薄弱章节可听同步提高课程（注意和满分冲刺课知识点对应）<br>3.时间充分的话，用同步基础课提前预习<br>4.期中期末考前听同步提高、满分冲刺考前串讲，考后针对丢分点用同步提高、满分冲刺课程补习<br>5.每章学完以后用同步提高、满分冲刺综合专题、习题课进行巩固拔高"
          }
        ],
        "english": [
          {
            "goal": "打好基础，掌握重点词汇和语言知识，有针对性提升读写能力，做到简单题不丢分",
            "method": "1.用同步提高课与学校同步复习，提升英语学科能力<br>2.通过练习重点题，掌握重点时态和复合句知识及用法<br>3.先自主思考，讲义上自主做题，不会的听视频讲解，听完后教练点拨总结方法"
          },
          {
            "goal": "1.学会知识的应用，中档题不丢分，做完型、阅读、写作有思路，少丢分",
            "method": "1.用同步提高课与学校同步复习，巩固所学内容；确保各专题模块的重难点易错点掌握透彻<br>2.用满分课提升学生综合能力，重点听完型、阅读 、写作专题，成绩提升一个档次"
          },
          {
            "goal": "1.大力拓展较难词汇的认知和使用，加深对较难知识的理解，全面提升读写能力<br>2.重点攻克完型、阅读、写作等难题，考试争取不丢分，冲刺满分",
            "method": "1.选用同步提高课部分课程、满分冲刺课，确保各专题模块的重难点易错点掌握透彻，提升学科整体水平<br>2.学习较难完型、阅读方法技巧，拓展阅读词汇，攻克难题无障碍"
          }
        ],
        "physics": [
          {
            "goal": "1.针对刚听过的知识，马上练题，学生先自主思考，讲义上自主做题，不会的听视频讲解，听完后教练点播总结方法<br>2.通过金题精讲掌握基本题型的解题思路和方法<br>3.通过基础课程学习基本物理规律和概念，培养高中物理解题习惯和思维",
            "method": "1.能够做对一些概念性题目，简单的计算<br>2.通过教练伴学课程的学习能够熟练应用基本公式和概念<br>3.理解好基本公式和概念，有意识的提高自己的科学思维能力"
          },
          {
            "goal": "1.通过视频课和教练的引导总结夯实力学基础，通过金题精讲深入理解各种物理模型和物理规律<br>2.通过学习同步提高课程和教练的指导学会多过程问题的分析方法和解题技巧",
            "method": "能够熟练的应用公式:<br>1.对于公式的选取能够做到灵活应对<br>2.能够准确的分析并解答与实际相结合的力学题目<br><br>受力分析熟练准确:<br>1.准确的做出受力分析和识别基本物理模型<br>2.掌握整体隔离法和动态分析的技巧"
          },
          {
            "goal": "1.难题训练：使用满分冲刺课做大量难题的练习，保证思维能力保持在顶尖水平，考试遇到难题有思路，争取难题不丢分<br>2.训练高效做题能力：通过教练伴学限时做题，每道题自判对错，教练把关，从平时做题开始，练习自己能够快速、准确做出所有题的能力，熟练的掌握力学综合题",
            "method": "1.夯实力学和运动学的基础<br>2.培养高中物理解题思维和习惯，为后面难度较大的学习奠定好的基础<br>3.能够站在一定的高度去分析问题解决问题，不断提高审题能力"
          }
        ],
        "chemistry": [
          {
            "goal": "1.适应高中化学的学习节奏，学习化学更轻松<br>2.学校上课大部分都能听懂，跟上学校的进度<br>3.将基础打牢，简单题不丢分，在中档题上尽量少丢分",
            "method": "1.用同步基础课复习物质的量、离子反应、氧化还原、金属、非金属及其化合物等基本概念<br>2.在教练的帮助下，制定适合自己的阶段提升计划，并按照计划稳步提升化学成绩<br>3.有任何疑问都可以提交给教练，教练会帮你及时解决<br>4.课下将听得不太明白的地方再听一遍，彻底搞懂，尽量将同步基础都听完"
          },
          {
            "goal": "1.掌握高中化学的学习方法，轻松取得高分<br>2.学校讲的都能听懂，完全跟上学校进度<br>3.中档题尽量拿到满分，难题拿少部分分数",
            "method": "1.用同步基础课理解物质的量、离子反应、氧化还原、金属、非金属及其化合物等基本概念，在教练的帮助下总结解题方法<br>2.将做题的过程拍照提交给教练，教练会发现你学习当中存在的问题，并为你制定适合你的阶段提升计划<br>3.根据教练指定的阶段提升计划，学习最适合自己的内容"
          },
          {
            "goal": "1.将化学的概念、原理形成自己的核心观念<br>2.冲刺满分，进一步提高解答难题的能力<br>3.难题，看到就有思路，能拿到满分",
            "method": "1.用同步提高课学习物质的量、离子反应、氧化还原、金属、非金属及其化合物的解题方法<br>2.在听课的过程中有任何疑问都可以提交给教练，教练及时解决，并帮你总结归纳，助你冲刺满分<br>3.根据教练制定的阶段提升计划，学习最适合自己的内容，提高学习的效率"
          }
        ]

      },
      "g2": {
        "math": [
          {
            "goal": "1.学校上课大部分都能听懂，基本跟上学校教学进度。提高课堂的积极性及效率，专心听讲<br>2.同步巩固基础知识，查缺补漏，掌握常见简单题中等题的解题思路，提高做题速度，规范解题步骤，基础题不丢分，中等题少丢分<br>3.培养自信，增强学习动力及主动性",
            "method": "1.先听同步基础课（注意和学校进度保持同步）<br>2.再听同步提高课前面几道简单题（注意和同步基础课知识点对应）<br>3.时间充分的话，补高一的薄弱知识，尤其是函数部分<br>4.期中期末考前听考前串讲，考后针对失分点用同步基础课程补习<br>5.每章学完以后用同步基础综合专题、习题课进行巩固"
          },
          {
            "goal": "1.学校讲的都能听懂，完全跟上学校进度<br>2.针对性查缺补漏，哪儿弱赶紧补哪儿，不留任何知识漏洞<br>3.提高解中等题能力及做题速度，规范书写步骤，锻炼思维能力，培养总结反思能力",
            "method": "1.先听同步提高课（注意和学校进度保持同步）<br>2.再听满分冲刺课程前几道题目进行拔高（注意和同步课知识对应）<br>3.时间充分的话，补高一的薄弱知识，尤其是函数部分<br>4.期中期末考前听同步提高、满分冲刺考前串讲，考后针对丢分点用同步提高课程补习<br>5.每章学完以后用同步提高、同步基础综合专题、习题课进行巩固拔高"
          },
          {
            "goal": "1.冲刺满分，进一步提高解答难题的能力<br>2.锻炼探索型、研究型、创新型思维能力，勤总结勤思考<br>3.学习进度适当加快，走在学校前面",
            "method": "1.先听满分冲刺课（注意和学校进度保持同步）<br>2.较薄弱章节可听同步提高课程（注意和满分冲刺课知识点对应）<br>3.时间充分的话，用同步基础课提前预习<br>4.期中期末考前听同步提高、满分冲刺考前串讲，考后针对丢分点用同步提高、满分冲刺课程补习<br>5.每章学完以后用同步提高、满分冲刺综合专题、习题课进行巩固拔高"
          }
        ],
        "english": [
          {
            "goal": "打好基础的同时查缺补漏，培养语感，提升读写能力，简单题不丢分，中档题多得分",
            "method": "1.用同步提高课与学校同步复习，巩固词汇和语法知识；给学生指出薄弱知识点，引领学生利用名师视频课查缺补漏<br>2.学生先自主思考，讲义上自主做题，学生自判答案对错，下次课复习错题，确保百分比掌握"
          },
          {
            "goal": "学会知识的应用，中档题不丢分，做完型、阅读、写作有思路，少丢分",
            "method": "1.用同步提高课与学校同步复习，巩固所学内容；用满分冲刺课提升完型、阅读能力，确保掌握综合题型方法技巧<br>2.教练严格把关，杜绝做题敷衍，克服粗心问题；重点题拓展思路、举一反三"
          },
          {
            "goal": "大力拓展较难词汇的认知和使用，加深对较难知识的理解和应用，全面提升听说读写能力，冲刺高分",
            "method": "1.选同步提高课与满分冲刺课，全面提升解题能力；重点题拓展思路、举一反三，冲刺满分<br>2.积累难题和较难词汇，加强读写练习，自我总结与反思，全面提升解题准确率与速度"
          }
        ],
        "physics": [
          {
            "goal": "1.教练与学生沟通学习情况，通过学生做题情况综合判断学生学习习惯和方法上存在的问题，课上持续督促学生改正<br>2.使用同步基础课巩固基础，视频课中名师罗列所有基础知识，并作详细讲解，学生可做笔记",
            "method": "1.能够掌握电磁基本题型的解题方法<br>2.对于简单的电学实验知道原理并能够得到部分分数<br>3.结合基础课程的学习掌握简单题目的解题技巧"
          },
          {
            "goal": "1.通过金题精讲达到举一反三的效果，通过错题追踪策略以及教练的引导，系统地、透彻地掌握同步提高课中所有难点知识以及经典题型<br>2.通过视频名师讲解和教练点拨，学生自己总结，通过同步提高课程夯实物理基础，为综合题目做好知识储备",
            "method": "1.掌握相对综合题目的分析方法<br>2.掌握基本的构建物理模型的思想和方法"
          },
          {
            "goal": "1.通过同步提高将高一所学内容适当的迁移并应用到新知识的学习中去<br>2.通过满分冲刺课程学会并掌握力电磁综合题目",
            "method": "1.能够熟练解决综合型题目<br>2.具备建立模型并解决问题的能力，冲刺满分"
          }
        ],
        "chemistry": [
          {
            "goal": "1.适应高二化学知识量大，难度高的特点，学习化学更轻松<br>2.学校上课大部分都能听懂，跟上学校的进度<br>3.将基础打牢，简单题不丢分，在中档题上尽量少丢分",
            "method": "1.用同步基础课掌握物质的结构、三大平衡、电化学、有机化学等基本概念<br>2.课上将自己解题过程提交给教练，教练会发现问题，并帮你解决问题<br>3.根据教练制定的阶段提升计划，学习适合自己的学习内容"
          },
          {
            "goal": "1.掌握高二化学的重难点，提高分析解释、推论预测的能力<br>2.学校讲的都能听懂，完全跟上学校进度<br>3.中档题尽量拿到满分，难题拿少部分分数",
            "method": "1.用同步提高课总结物质的结构、三大平衡、电化学、有机化学等相关题型的解题方法<br>2.将做题的过程拍照提交给教练，教练会发现你学习当中存在的问题，并为你制定适合你的阶段提升计划<br>2.根据教练指定的阶段提升计划，学习最适合自己的内容"
          },
          {
            "goal": "1.彻底理解高二化学的所有重难点，提高简单设计，综合复杂问题解决的能力<br>2.冲刺满分，进一步提高解答难题的能力<br>3.难题，看到就有思路，能拿到满分",
            "method": "1.用同步提高课提升物质的结构、三大平衡、电化学、有机化学等相关提升的解题技巧<br>2.在听课的过程中有任何疑问都可以提交给教练，教练及时解决，并帮你总结归纳，助你冲刺满分<br>3.根据教练制定的阶段提升计划，学习最适合自己的内容，提高学习的效率"
          }
        ]

      },
      "g3": {
        "math": [
          {
            "goal": "1.学校上课大部分都能听懂，跟上学校一轮、二轮复习进度，在课堂上不浪费时间<br>2.正确看待高考，对自己有信心，确定自己努力的方向<br>3.简单题不丢分，查缺补漏，夯实基础",
            "method": "巩固基础知识:<br>1.听高考总复习基础课程，选听高一轮、二轮课程中的部分内容（注意和学校进度保持同步）<br>2.在教练的帮助下加深概念、定理、重点题型方法等的理解运用<br>3.补听高一与高二薄弱章节，尤其是函数部分课程<br><br>培养解题思维:<br>针对刚听过的知识，马上练题，学生先自主思考，讲义上自主做题，不会的听视频讲解，听完后教练点播总结方法"
          },
          {
            "goal": "1.调整心态，正确看待高考，对自己定位准确，确定哪些知识必须拿全分；<br>2.抓一部分难题的分，考试能有进步",
            "method": "1.听高考一轮、二轮复习课程（注意和学校进度保持同步）<br>2.巩固复习高考一轮、二轮复习课程某一章节正确率低于50%的课（可以使用对应章节的高考总复习基础课程）<br>3.补听高一函数等知识的同步提高与满分冲刺课程"
          },
          {
            "goal": "1.突破难题压轴题，遇到压轴题有思路，做难题耗时较短<br>2.学会总结，力争做一题会一类<br>3.考试成绩能够稳定在接近满分的水平",
            "method": "1.听高考一轮、二轮复习课程（注意和学校进度保持同步）；<br>2.补听高一函数部分等满分冲刺课，丰富自己难题的题型<br>3.在教练的帮助下学会归纳总结：课上错题均写错点、错因或方法总结"
          }
        ],
        "english": [
          {
            "goal": "1.掌握学校正在学的基本知识，其它的尽可能掌握<br>2.进行一二轮全面复习，争取简单题不丢分、中档题多得分",
            "method": "1.使用高考一二三轮，确保学生掌握重点词汇和语法知识，尽可能理解难点、多得分<br>2.发现学生有问题，老师及时答疑解惑；查阅学生提交的题目，发现问题连线解决，做到讲一题，会一类<br>3.练习阅读、完型、写作、听力真题，熟悉全部常考题型"
          },
          {
            "goal": "1.完全掌握考纲所要求的知识和词汇、熟练应用各题型解题方法<br>2.着手一二轮复习，针对高考真题，做到中档题不丢分，难题掌握做题方法技巧，多得分",
            "method": "1.使用高考一二三轮，通过错题追踪策略，本次错题下次课重做，确保做过的题100%掌握<br>2.突破复合句、非谓语动词、阅读长难句等难点，积累常考题技巧方法<br>3.学生先自主思考，讲义上自主做题，教练点拨总结，做到举一反三"
          },
          {
            "goal": "1.跟着学校进度进行一二摸复习和考试，成绩逐步提升<br>2.查漏补缺，全面提升听说读写能力，争取做到考试不丢分，冲刺满分",
            "method": "1.使用高考一二三轮，做近两年高考真题，从平时练习开始，做到少出错、甚至不出错，高考冲刺满分<br>2.通过教练伴学限时做题，自判对错，教练把关，练习快速、准确做出所有题的能力<br>3.突破阅读长难句、被动语态、复合句、虚拟语气等较难知识点，熟练做题，提高做题速度"
          }
        ],
        "physics": [
          {
            "goal": "1.通过高考基础课程的学习，全面复习高考基础考点，教练严格把关<br>2.教练鼓励、陪伴学生，让学生找回学习的积极性,掌握基本物理模型",
            "method": "1.掌握高考基础考点，拿到所有的基础分数<br>2.综合题能做对一部分，拿到部分分数"
          },
          {
            "goal": "1.教练针对学生情况，针对高考该抓哪些分，确定学习侧重点和要求<br>2.通过教练伴学课程掌握力电磁功能综合题的分析方法并能够灵活应用",
            "method": "1.掌握高考考点和题型<br>2.熟悉高考力电磁综合题的分析方法<br>3.提高审题能力，能够快速找到题目题突破口"
          },
          {
            "goal": "1.通过高考一轮复习夯实各类综合题基础知识<br>2.进行难题训练，建立物理模型和各类题型的解题思路<br>3.通过教练伴学限时做题，每道题自判对错，教练把关，从平时做题开始，练习自己能够快速、准确做出所有题的能力，考试不丢分，冲刺满分",
            "method": "1.能够熟练解决力电磁综合题目<br>2.具备将实际问题提炼出物理模型并解决问题的能力<br>3.掌握各类题型的综合分析方法"
          }
        ],
        "chemistry": [
          {
            "goal": "1.将高一高二化学的所有基础知识做系统性的回顾复习，并基本理解<br>2.将基础打牢，简单题不丢分，在中档题上尽量少丢分<br>3.学校上课大部分都能听懂，跟上学校的进度",
            "method": "1.先用高考总复习基础课将高一高二化学所有基础知识系统的复习一遍，再用一二轮复习做提升<br>2.在教练的帮助下制定适合自己的阶段提升计划，学习相应的内容，最高效率的利用视频课<br>3.上课的过程中，将自己的做题过程提交给教练，教练会发现你的问题，并给出对应的学习建议"
          },
          {
            "goal": "1.在将高中化学的所有基础知识完全掌握的基础上，进一步提升解题能力<br>2.中档题尽量拿到满分，难题拿少部分分数<br>3.为高考化学打好基础",
            "method": "1.用一轮复习课将化学所有知识点融会贯通，形成知识网络，进一步提高解题能力<br>2.课上将解题步骤提交给教练，教练会发现你的问题，并给出对应的解决方法<br>3.根据教练给出的计划，听最适合自己的课程，高效的利用视频课"
          },
          {
            "goal": "1.将高中化学知识形成知识网络体系，最终培训化学的学科素养<br>2.冲刺满分，进一步提高解答难题的能力<br>3.高考化学争取能考到满分",
            "method": "1.用一二轮复习攻克有机综合题、原理综合分析题、物质结构题、实验探究题、工业流程题等题型的所有疑点<br>2.在教练的帮助下制定适合自己的阶段提升计划，针对高中化学的八个板块、30个核心考点做系统复习<br>3.课上把把自己的疑问提交给教练，教练会及时的为你解决所有疑问，并帮你作总结归纳"
          }
        ]
      }
    }
    ;
  // 讲条件内容显示方法
  function levesInit(grade, subject) {
    $('.j_levelsMethod').map(function (levels) {
      $(this).html(levelsData[grade][subject][parseInt($(this).attr('levels'))].method);
    });
    $('.j_levelsGoal').map(function () {
      $(this).html(levelsData[grade][subject][parseInt($(this).attr('levels'))].goal);
    });
  };
  var hasBanner = true;
  if($('#J_naviItem').val()<5){
    hasBanner = true;
  }else{
    hasBanner = false;
  }
  window.onload = function(){
    var nav = $('#J_navigation');
    var courseNav = $('#J_courseNav');
    var courseNavStartHeight = $('#J_levelsContent').offset().top-220;
    levesInit(grade,subject);
    window.onscroll = function(){
      var top = document.body.scrollTop ? document.body.scrollTop : document.documentElement.scrollTop;//w3c，各ie的兼容
      if(top >=30){
        if(hasBanner){
          if( top >=350 ){
            $('.j_navRight').css('display','block');
          }else{
            $('.j_navRight').css('display','none');
          }
        }
        nav.addClass('nav-fixed');
      }else{
        nav.removeClass('nav-fixed');
      }
      if(top >= courseNavStartHeight){
        courseNav.css('display','block');
      }else{
        courseNav.css('display','none');
      }
    }
  };
  // 点击年级事件
  gradeItem.on('click',function () {
    var num = parseInt($(this).attr('num'));
    grade = $(this).attr('grade');
    gradeItem.removeClass('select-active').eq(num).addClass('select-active');
    gradeItem.eq(num+6).addClass('select-active');
    if(num == 0){
      $('.j_courseSubject span:eq(2),.j_courseSubject span:eq(3),.j_courseSubject span:eq(6),.j_courseSubject span:eq(7)').css('display','none');
      if( subject == 'physics' || subject == 'chemistry' ){
        subject = 'math';
        subjectItem.removeClass('select-active').eq(0).addClass('select-active');
        subjectItem.eq(4).addClass('select-active');
      }
    }else if(num == 1){
      $('.j_courseSubject span:eq(2),.j_courseSubject span:eq(6)').css('display','inline-block');
      $('.j_courseSubject span:eq(3),.j_courseSubject span:eq(7)').css('display','none');
      if( subject == 'chemistry' ){
        subject = 'math';
        subjectItem.removeClass('select-active').eq(0).addClass('select-active');
        subjectItem.eq(4).addClass('select-active');
      }
    }else{
      $('.j_courseSubject span:eq(2),.j_courseSubject span:eq(3),.j_courseSubject span:eq(6),.j_courseSubject span:eq(7)').css('display','inline-block');
    }
    levesInit(grade,subject);
  });
  // 点击学科事件
  subjectItem.on('click',function () {
    var num = parseInt($(this).attr('num'));
    subject = $(this).attr('subject');
    subjectItem.removeClass('select-active').eq(num).addClass('select-active');
    subjectItem.eq(num+4).addClass('select-active');
    levesInit(grade,subject);
  });
})();
